In [1]:
import sqlite3

data base will be remain there but table will be removed

In [2]:
db=sqlite3.connect('my_studentdatabse2.db')

In [3]:
cur=db.cursor()

In [4]:
cur.execute("create table student22 (id int primary key,name text,marks int)")

In [5]:
cur.execute("insert into student22(id,name,marks) values(1,'John',90)")
db.commit()

In [6]:
cur.execute("insert into student22(id,name,marks) values(2,'Teena',90)")
db.commit()

In [7]:
cur.execute("insert into student22(id,name,marks) values(3,'Andrew',90)")
db.commit()

In [8]:
results=cur.execute("select * from student")

for row in results:
    print(row)

(1, 'Andrew', 32)
(2, 'Smith', 32)
(3, 'John', 22)
(4, 'Jack', 35)
(5, 'Lisa', 24)
(6, 'Brain', 22)
(7, 'William', 24)
(8, 'Kira', 29)
(9, 'David', 22)

# In python data base sheet your student table will be deleted but the creation of the table will be same so that if you are working in id, name age in that format only data base sheet work if your shift to mark create new date sheet